
## Plan Result

[CI link](https://github.com/scarowar/test-terraform-branch-deploy/actions/runs/21115113924)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.test


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = <<-EOT
            Environment: dev
            Message: Development environment test
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./output.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + file_path = "./output.txt"
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Resource targeting is in effect
 
 You are creating a plan with the -target option, which means that the
 result of this plan may not represent all of the changes requested by the
 current configuration.
 
 The -target option is not for routine use, and is provided only for
 exceptional situations such as recovering from errors or mistakes, or when
 Terraform specifically suggests to use it as part of an error message.
```



<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":232,"Program":"tfcmt","SHA1":"7ba7b016b0ba8863856fe0ad9c8680c32c7a4c9f","Vars":{},"WorkflowName":"Terraform Deploy"} -->